rapport-2023-09-15.tex
% Created 2023-09-11 Mon 13:48
% Intended LaTeX compiler: pdflatex

% =================================BASE====================================%
\documentclass[10pt]{article}
\usepackage[left=2cm,right=2cm,top=2cm,bottom=2cm]{geometry} % Marges
%\usepackage{libertine}
%\usepackage{libertinust1math}
\usepackage[T1]{fontenc} % Nécessaire avec FrenchBabel
\usepackage[utf8]{inputenc} % Important pour symboles Francophones, é,à,etc

\usepackage{lmodern}
\renewcommand{\familydefault}{cmr} % La meilleure police (CMU Serif Roman) (Je me suis battu).
\usepackage{mathrsfs} %Permet la command \mathscr (Lettres attachées genre)

\usepackage[round, sort]{natbib} % Bibliographie
\bibliographystyle{abbrvnat}



\usepackage{amsmath, amssymb, amsthm} % Symb. math. (Mathmode+Textmode) + Beaux théorèmes.

\usepackage{mathtools,cancel,nicefrac} % Utilisation de boîtes \boxed{} + \cancelto{}{}
\usepackage{graphicx, wrapfig} % Géstion des figures.
\usepackage{hyperref} % Permettre l'utilisation d'hyperliens.
\usepackage{color} % Permettre l'utilisation des couleurs.
\usepackage[dvipsnames]{xcolor} % Couleurs avancées.
\usepackage{titling} % Donne accès à \theauthor, \thetitle, \thedate

% >>> Physique >>>
\usepackage{physics} % Meilleur package pour physicien. 
\usepackage{pxfonts} % Rajoute PLEIN de symboles mathématiques, dont les intégrales doubles et triples
% <<< Physique <<<

\usepackage{lipsum} % For fun
\usepackage{tikz} % Realisation de figures TIKZ.
\usepackage{empheq} % Boite autour de MULTIPLE équations

\usepackage[french]{babel} % Environnements en Français.
% ==============================BASE-(END)=================================%



% ================================SETTINGS=================================%
% Pas d'indentation en début de paragraphe :
\setlength\parindent{0pt} 

% Couleurs de hyperliens :
\definecolor{mypink}{RGB}{147, 0, 255}
\hypersetup{colorlinks, 
             filecolor=mypink,
             urlcolor=mypink, 
             citecolor=mypink, 
             linkcolor=mypink, 
             anchorcolor=mypink}

% Numéros d'équations suivent les sections :
\numberwithin{equation}{section} 

% Les « captions » sont en italique et largeur limitée
\usepackage[textfont = it]{caption} 
\captionsetup[wrapfigure]{margin=0.5cm}

% Retirer le l'écriture en gras dans la table des matières
\usepackage{tocloft}
\renewcommand{\cftsecfont}{\normalfont}
\renewcommand{\cftsecpagefont}{\normalfont}

% Change bullet style
\usepackage{pifont}
\usepackage{enumitem}
%\setlist[itemize,1]{label=\ding{224}}
\setlist[itemize,1]{label=\ding{239}}
\renewcommand{\boxtimes}{\blacksquare}
% ================================SETTINGS=================================%



% ==============================NEWCOMMANDS================================%
% Degrés Celsius :
\newcommand{\celsius}{${}^\circ$ C} % \degrée Celsius : Pas mal plus simple qu'utilise le package gensymb qui plante avec tout...

% Vecteurs de base :
\newcommand{\nvf}{\vb{\hat{n}}}
\newcommand{\ivf}{\vb{\hat{i}}}
\newcommand{\jvf}{\vb{\hat{j}}}
\newcommand{\kvf}{\vb{\hat{k}}}

\newcommand{\uu}{\vb*{u}}
\newcommand{\vv}{\vb*{v}}

% Boîte vide pour ajuster les underbrace
\newcommand{\bigno}{\vphantom{\qty(\frac{d}{q})}}
\newcommand{\pt}{\hspace{1pt}}

% Physics empty spaces 
\newcommand{\typical}{\vphantom{A}}
\newcommand{\tall}{\vphantom{A^{x^x}_p}}
\newcommand{\grande}{\vphantom{\frac{1}{xx}}}
\newcommand{\venti}{\vphantom{\sum_x^x}}

% Moyenne numérique entre deux points de grilles. 
\newcommand{\xmean}[1]{\overline{#1}^x}
\newcommand{\ymean}[1]{\overline{#1}^y}
\newcommand{\zmean}[1]{\overline{#1}^z}
\newcommand{\xymean}[1]{\overline{#1}^{xy}}

% Tilde over psi
\newcommand{\tpsi}{\tilde{\psi}}
\newcommand{\tphi}{\tilde{\phi}}

% Nota Bene env :
\newcommand{\nb}{\ding{165}\ \textbf{N.B.}\hspace{4pt}}
   
% ==============================NEWCOMMANDS================================%



% ==============================PAGE-TITRE=================================%
% Titlepage 
\newcommand{\mytitlepage}{
\begin{titlepage}
\begin{center}
{\Large Contrat Été 2023 \par}
\vspace{2cm}
{\Large \MakeUppercase{\thetitle} \par}
\vspace{2cm}
RÉALISÉ DANS LE CADRE\\ D'UN PROJET POUR \par
\vspace{2cm}
{\Large ISMER--UQAR \par}
\vspace{2cm}
{\thedate}
\end{center}
\vfill
Rédaction \\
{\theauthor}\\
\url{charles-edouard.lizotte@uqar.ca}\\
ISMER-UQAR
\end{titlepage}
}
% ==============================PAGE-TITRE=================================%



% =================================ENTÊTE==================================%
\usepackage{fancyhdr}
\pagestyle{fancy}
\setlength{\headheight}{13pt}
\renewcommand{\headrulewidth}{0.05pt} % Ligne horizontale en haut

\fancyhead[R]{\textit{\thetitle}}
\fancyhead[L]{\ \thepage}
\fancyfoot[R]{\textit{\theauthor}}
\fancyfoot[L]{}
\fancyfoot[C]{} 
% =================================ENTÊTE==================================%
\author{Charles-Édouard Lizotte}
\date{01/09/2023}
\title{Carnet de bord, Université McGill}
\hypersetup{
 pdfauthor={Charles-Édouard Lizotte},
 pdftitle={Carnet de bord, Université McGill},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.6.7)}, 
 pdflang={French}}
\begin{document}

\mytitlepage
\tableofcontents\newpage

\section{Stratification -- \textit{<2023-09-11 Mon>}}
\label{sec:orga18fb9e}
À deux couches, on se souvient que le calcul des valeurs propres du \href{rapport-2023-09-01.pdf}{rapport précédent} nous amène à
\begin{align}
   && \lambda_1 = 0 && \lambda_2 = \frac{f_0^2}{g} \qty(\frac{H_1+H_2}{H_1 H_2}) = k_d^2. &&
\end{align}
Et le rayon de déformation de Rossby (\(\L_D\)) est relié à la vitesse des ondes baroclines par
\begin{equation}
   L_D = \frac{c_{bc}}{f_0}.
\end{equation}
En substituant, on retrouve finalement
\begin{equation}
\label{eq:org0d918dc}
   \boxed{\hspace{0.3cm}\Delta\rho = \qty(\frac{H_1+H_2}{H_1H_2})\pt\rho_1 g c_{bc}^2.\venti\hspace{0.3cm}}
\end{equation}
Concrétement, l'équation \ref{eq:org0d918dc} nous renseigne sur l'intégration la vitesse des ondes baroclines dans la stratification entre la première et la seconde couche.

\subsection{Stratification raisonnable -- \textit{<2023-09-11 Mon>}}
\label{sec:org517014e}
La stratification devrait -- grosso modo -- suivre une courbe exponentielle décroissante.
Pour s'assurer que la vitesse des ondes baroclines soit toujours la même entre chaque couche, on utilise la règle
\begin{equation}
   \rho_k = \rho_{k-1} + \frac{\rho_1}{g}\pt\qty(\frac{H_{k-1}+H_k}{H_{k-1}H_k})\cdot c_{bc}^2
\end{equation}

Les résultats de la construction précédente se retrouvent dans le tableau \ref{tab:org120260f}

\begin{table}[htbp]
\caption{\label{tab:org120260f}Épaisseurs et densités des différentes couches pour le test du modèle à 5 couches.}
\centering
\begin{tabular}{lccc}
Nom & Symbole & Valeur & Unités\\[0pt]
\hline
\hline
Densité de la première couche & \(\rho\)\textsubscript{1} & 1000.0 & kg/m\textsuperscript{3}\\[0pt]
Densité de la seconde couche & \(\rho\)\textsubscript{2} & 1005.3 & kg/m\textsuperscript{3}\\[0pt]
Densité de la troisième couche & \(\rho\)\textsubscript{3} & 1007.3 & kg/m\textsuperscript{3}\\[0pt]
Densité de la quatrième couche & \(\rho\)\textsubscript{4} & 1008.4 & kg/m\textsuperscript{3}\\[0pt]
Densité de la dernière couche & \(\rho\)\textsubscript{5} & 1009.0 & kg/m\textsuperscript{3}\\[0pt]
\hline
Épaisseur de la première couche & H\textsubscript{1} & 100 & m\\[0pt]
Épaisseur de la première couche & H\textsubscript{2} & 300 & m\\[0pt]
Épaisseur de la première couche & H\textsubscript{3} & 600 & m\\[0pt]
Épaisseur de la première couche & H\textsubscript{4} & 1000 & m\\[0pt]
Épaisseur de la première couche & H\textsubscript{5} & 2000 & m\\[0pt]
\hline
\hline
\end{tabular}
\end{table}
\end{document}